docs/CS/MachineLearning/BasicModule.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-23 Sat 12:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Linear Regression with Multiple Variables</a></li>
<li><a href="#orgheadline2">2. Polynomial regression</a></li>
<li><a href="#orgheadline3">3. Taylor expansion:</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Linear Regression with Multiple Variables</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Gradient Descent:</li>
</ul>
<p>
Taking the derivative (the tangential line to a function) of our cost function.
The slope of the tangent is the derivative at that point and it will give us a direction to move towards.
We make steps down the cost function in the direction with the steepest descent.
The size of each step is determined by the parameter α, which is called the learning rate.
</p>
<ul class="org-ul">
<li>Algorithm:</li>
</ul>
<p>
\[\Theta_j = \Theta_j + \Alpha\Derivative{J(\Theta_0,\Theta_1)}\]
Update simutaneously:
\[Temp_0 := \Theta_0 - \Alpha\Derivative{J(\Theta_0,\Theta_1)} \]
\[Temp_1 := \Theta_1 - \Alpha\Derivative{J(\Theta_0,\Theta_1)} \]
</p>
<ul class="org-ul">
<li>normalization</li>
</ul>
<p>
\[\theta_0 = \theta_0 - \alpha\partial{J(\theta)}{\theta}\]
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Polynomial regression</h2>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Taylor expansion:</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #75715E;"># </span><span style="color: #75715E;">-*- coding: utf-8 -*-</span>
<span style="color: #F92672;">import</span> numpy <span style="color: #F92672;">as</span> np
<span style="color: #F92672;">import</span> math
<span style="color: #F92672;">import</span> pprint


<span style="color: #F92672;">def</span> <span style="color: #A6E22E;">cal_e_small</span><span style="color: #AE81FF;">(</span>x<span style="color: #AE81FF;">)</span>:
    <span style="color: #FD971F;">n</span> = <span style="color: #AE81FF;">10</span>
    <span style="color: #FD971F;">f</span> = np.arange<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">1</span>, n+<span style="color: #AE81FF;">1</span><span style="color: #AE81FF;">)</span>.cumprod<span style="color: #AE81FF;">()</span>
    <span style="color: #FD971F;">b</span> = np.array<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span>x<span style="color: #66D9EF;">]</span>*n<span style="color: #AE81FF;">)</span>.cumprod<span style="color: #AE81FF;">()</span>
    <span style="color: #F92672;">return</span> np.<span style="color: #F92672;">sum</span><span style="color: #AE81FF;">(</span>b/f<span style="color: #AE81FF;">)</span> + <span style="color: #AE81FF;">1</span>


<span style="color: #F92672;">def</span> <span style="color: #A6E22E;">cal_e</span><span style="color: #AE81FF;">(</span>x<span style="color: #AE81FF;">)</span>:
    <span style="color: #FD971F;">reverse</span> = <span style="color: #AE81FF;">False</span>
    <span style="color: #F92672;">if</span> x &lt; <span style="color: #AE81FF;">0</span>:
        <span style="color: #FD971F;">x</span> = -x
        <span style="color: #FD971F;">reverse</span> = <span style="color: #AE81FF;">True</span>
    <span style="color: #FD971F;">ln2</span> = <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">69314718055994529</span>
    <span style="color: #FD971F;">c</span> = x / ln2
    <span style="color: #FD971F;">a</span> = <span style="color: #F92672;">int</span><span style="color: #AE81FF;">(</span>c + <span style="color: #AE81FF;">0</span>.<span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">)</span>
    <span style="color: #FD971F;">b</span> = x - a * ln2
    <span style="color: #FD971F;">y</span> = <span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">2</span> ** a<span style="color: #AE81FF;">)</span> * cal_e_small<span style="color: #AE81FF;">(</span>b<span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">if</span> reverse:
        <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">1</span> / y
    <span style="color: #F92672;">return</span> y


<span style="color: #FD971F;">t1</span> = np.linspace<span style="color: #AE81FF;">(</span>-<span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">0</span>, <span style="color: #AE81FF;">10</span>, endpoint=<span style="color: #AE81FF;">False</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">t2</span> = np.linspace<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">0</span>, <span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">20</span><span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">t</span> = np.concatenate<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span>t1, t2<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span>t<span style="color: #AE81FF;">)</span>
<span style="color: #FD971F;">y</span> = np.empty_like<span style="color: #AE81FF;">(</span>t<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">for</span> i, x <span style="color: #F92672;">in</span> <span style="color: #F92672;">enumerate</span><span style="color: #AE81FF;">(</span>t<span style="color: #AE81FF;">)</span>:
    <span style="color: #FD971F;">y</span><span style="color: #AE81FF;">[</span>i<span style="color: #AE81FF;">]</span> = cal_e<span style="color: #AE81FF;">(</span>x<span style="color: #AE81FF;">)</span>
    <span style="color: #F92672;">print</span><span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'e^'</span>, x, <span style="color: #E6DB74;">' = '</span>, y<span style="color: #66D9EF;">[</span>i<span style="color: #66D9EF;">]</span>, <span style="color: #E6DB74;">', appx = \t'</span>, math.exp<span style="color: #66D9EF;">(</span>x<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<pre class="example">
e^ -2.0  =  0.135335283237 , appx =    0.1353352832366127
e^ -1.8  =  0.165298888222 , appx =    0.16529888822158653
e^ -1.6  =  0.201896517995 , appx =    0.20189651799465538
e^ -1.4  =  0.246596963942 , appx =    0.2465969639416065
e^ -1.2  =  0.301194211912 , appx =    0.30119421191220214
e^ -1.0  =  0.367879441171 , appx =    0.36787944117144233
e^ -0.8  =  0.449328964117 , appx =    0.4493289641172217
e^ -0.6  =  0.548811636094 , appx =    0.5488116360940265
e^ -0.4  =  0.670320046036 , appx =    0.6703200460356393
e^ -0.2  =  0.818730753078 , appx =    0.8187307530779819
e^ 0.0  =  1.0 , appx =    1.0
e^ 0.105263157895  =  1.11100294108 , appx =   1.1110029410844708
e^ 0.210526315789  =  1.2343275351 , appx =    1.2343275350983443
e^ 0.315789473684  =  1.37134152176 , appx =   1.3713415217558058
e^ 0.421052631579  =  1.5235644639 , appx =    1.523564463901954
e^ 0.526315789474  =  1.69268460033 , appx =   1.692684600326856
e^ 0.631578947368  =  1.88057756929 , appx =   1.8805775692915292
e^ 0.736842105263  =  2.08932721042 , appx =   2.089327210420374
e^ 0.842105263158  =  2.32124867566 , appx =   2.3212486756648487
e^ 0.947368421053  =  2.57891410565 , appx =   2.57891410565208
e^ 1.05263157895  =  2.86518115618 , appx =    2.8651811561836884
e^ 1.15789473684  =  3.18322469126 , appx =    3.1832246912598827
e^ 1.26315789474  =  3.53657199412 , appx =    3.5365719941224363
e^ 1.36842105263  =  3.92914188683 , appx =    3.929141886826998
e^ 1.47368421053  =  4.3652881922 , appx =   4.365288192202982
e^ 1.57894736842  =  4.84984802022 , appx =    4.849848020218827
e^ 1.68421052632  =  5.38819541428 , appx =    5.388195414275814
e^ 1.78947368421  =  5.9863009524 , appx =   5.986300952398287
e^ 1.89473684211  =  6.65079796433 , appx =    6.650797964331267
e^ 2.0  =  7.38905609893 , appx =    7.38905609893065
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-09-23 Sat&gt;</span></span></p>
<p class="author">Author: weiwu</p>
<p class="date">Created: 2017-09-23 Sat 12:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
